[{"data":1,"prerenderedAt":230},["Reactive",2],{"search-api":3},[4,11,18,24,30,36,44,51,59,65,72,79,86,93,103,111,117,123,129,135,141,148,154,164,172,180,188,211,221],{"id":5,"path":6,"dir":7,"title":8,"description":7,"keywords":9,"body":10},"content:0.index.md","/","","Home",[],"    The Troop 27 Mission   To provide a safe and challenging learning environment for your son through the methods and ideals of the Boy Scouts of America. We will build character, foster friendships, and nurture citizenship through a dynamic outdoor program that challenges the boys to live by the Scout Oath and Law.     Troop 27 Signups   None    How do I ....      Click here to sign up for Google Group.   Please note: Only members of the group can send/view messages to the group.  Send email to Troop:   bsatroop27@googlegroups.com   Click here to view previous messages     Register Online        Summer Camp @ Ransburg      Scuba High Adventure  ",{"id":12,"path":13,"dir":14,"title":15,"description":7,"keywords":16,"body":17},"content:2.about:1.why-scouting.md","/about/why-scouting","about","Why Scouting",[],"    Why Scouting    SCOUTING will fulfill the promise of the great outdoors, teaching how to camp without leaving a trace of evidence that you were there.  SCOUTING will teach you how to care for and nurture the land and its animals.  SCOUTING promises you the joy of friendship, both through old friends you have known for years and new friends you have yet to meet.  SCOUTING gives you the opportunity to work toward the Eagle Scout Rank. You will learn to set goals for yourself, map a course to achieve them and follow through to success.  SCOUTING promises you experiences and responsibilities that will help you mature into a strong, wise adult.",{"id":19,"path":20,"dir":14,"title":21,"description":7,"keywords":22,"body":23},"content:2.about:2.troop-philosophy.md","/about/troop-philosophy","Troop Philosophy",[],"    Troop Philosophy  Troop 27 operates on the simple philosophy that Boy Scouts are having the most fun when hiking, exploring, and challenging themselves. To this end, we feel that lightweight camping has become a lost art. Too much emphasis has been placed on bringing creature comforts and lots of support gear. Many great troops operate this way although several trucks and trailers are required to move the troop from point to point. Cooking and cleaning soon occupy two hours per meal and, when added up, a significant portion of your time in the outdoors is wasted. Our Scouts carry their own food and gear, cook on lightweight stoves, and backpack into the campsite even if we have the ability to drive in. By doing this, the Scout learns to bring only what he needs and to pack light. At the campsite, this translates into less gear to keep track of, less gear to clean, and more time to enjoy the outdoors. Scouts in Troop 27 are constantly improving their outdoor skills through experience.  Troop 27 maintains very little camping gear (water purifier, shovel, flag, etc.) because it is expected the scout will acquire the necessary gear over time through gifts and fundraising and eventually have a complete set of camping gear he can use even after leaving scouts.  Troop 27 Purpose: (as developed by the seven parents and scouts who started the troop back in 2002!)    To be a high speed, low drag troop.   Carry everything you need on your back!  Respect for adults  Respect for each other and always be willing to help each other  Respect for the American flag and traditions  Respect for your uniform – always worn properly with SHIRTS always tucked in  \"Yes sir,  Yes mam!\"  Always use with adults, not just during troop functions  Be proud to be a scout with ultimate goal of attaining Eagle Scout rank and have fun too!  Pay your own way to summer camp through troop & personal fund raising  Summer camp out of the Texas summer heat!  Meet on Sunday twice a month to help encourage a well rounded boy in sports, band, choir or any other school activity.  Prioritize and keep all in balance and still keep up with your school grades.  Above all, have fun and learn as much as you can!",{"id":25,"path":26,"dir":14,"title":27,"description":7,"keywords":28,"body":29},"content:2.about:3.meetings.md","/about/meetings","Meetings",[],"    Meetings     Troop Meetings    Where:\tThe Pavilion at Saint John Vianney Catholic Church.  When: \tSunday night 4-6 p.m. (twice a month)  These days float and are scheduled in advance to avoid major holidays or events (i.e. Mothers Day)  Dress:\tClass A     (Full Dress Class A for Court of Honor)  Bring:\tScout Handbook, pencil/pen/paper  Address:\t3201 Sunrise Road Round Rock, Texas 78664-9416  Phone: \t(512) 218-1183\n    Directions    Patrol Leaders Council (PLC)    Where:\tSaint John Vianney Catholic Church  When:\tSunday afternoon at 3:00 pm before each troop meeting.  Who:\tBoys holding positions of responsibility:(Senior Patrol Leader, Asst. Senior Patrol Leader,Patrol Leader, Asst. Patrol Leader, Troop Scribe, etc.)  Uniform:\tClass A  Bring:\tCalendar, any planning materials    Troop Committee Meeting    Where:\tNormally held at SJV Boscoe Building.  When:\t7 p.m. on the Wednesday after the first troop meeting of the month. See the troop calendar.  Who:\tAdults holding positions of responsibility and parents who want to be more involved in troop organization and policies decisions.  Uniform:\tClass A",{"id":31,"path":32,"dir":14,"title":33,"description":7,"keywords":34,"body":35},"content:2.about:4.calendar.md","/about/calendar","Calendar",[],"    Calendar  Hint: You can add this shared calendar to your own google calendar.  Subscribe to Google calendar id   bsatroop27webmaster@gmail.com  Note: \"Non-Troop Event\" means that it isn't an event the Troop is doing all together, they are primarily informational and may be you want to attend or know about. ",{"id":37,"path":38,"dir":14,"title":39,"description":7,"keywords":40,"body":43},"content:2.about:5.fundraising.md","/about/fundraising","Fundraising",[41,42],"Annual Spring Mulch Sales","Fall Christmas Greenery Fundraiser","    Fundraising  The main source of funding for the troop is two annual fundraising projects.   The fall wreath and centerpiece sale begins in the early part of November. The spring mulch sale begins in the early part of February.   Each scout is expected to participate. The proceeds of the sales are used to financially support the troop and assist scouts in paying for troop activities. See   Financial Policy  for more information. Any suggestions you have for fundraising can be directed to the fundraising chairman on the troop committee.  Annual Spring Mulch Sales       \nOur Spring Fundraiser starts in January and runs through March/April\n  5 Bag Minimum  Here is the link for scout order entry:   http://fundraiser.bsatroop27.us  Questions?  Contact coordinator at   fundraiser@bsatroop27.us .  Thank you for supporting Troop 27.  Fall Christmas Greenery Fundraiser       \nFor the holidays, Troop 27 sells Christmas wreaths as a fundraiser.  It is a great opportunity to alleviate costs for Winter Camp, Summer Camp, and/or High Adventure Camps.  See the Financial Policy Page for more information.\n  Questions?  Contact coordinator at   fundraiser@bsatroop27.us .  Thank you for supporting Troop 27.|",{"id":45,"path":46,"dir":14,"title":47,"description":7,"keywords":48,"body":50},"content:2.about:6.our-eagles.md","/about/our-eagles","Our Eagles",[49],"Getting help with Eagle Projects","    Our Eagles       \nEagle Honor Roll: This is our complete list of scouts who reach the rank of Eagle Scout while a member of Troop 27.\n     Number  Name  Date  Troop  District  Council  OA Lodge    1  Scott Delgado  05-22-04  27  Tomahawk  Capitol Area  Tonkawa   2  Jon Kirk  05-23-05  27  Tomahawk  Capitol Area  Tonkawa   3  Brian Delgado  06-20-05  27  Tomahawk  Capitol Area  Tonkawa   4  Ian Wagman  03-26-06  27  Tomahawk  Capitol Area  Tonkawa   5  Nick Cestari  09-24-06  27  Tomahawk  Capitol Area  Tonkawa   6  Kyle Grandin  09-24-06  27  Tomahawk  Capitol Area  Tonkawa   7  Michael Auffant  02-10-07  27  Tomahawk  Capitol Area  Tonkawa   8  Zach Cestari  02-10-07  27  Tomahawk  Capitol Area    9  Mitchell Coe  05-18-08  27  Chisholm Trail  Capitol Area  Tonkawa   10  Kyle Whatley  06-01-08  27  Chisholm Trail  Capitol Area  Tonkawa   11  Jamie High  07-27-08  27  Chisholm Trail  Capitol Area  Tonkawa   12  Austin Caswell  08-10-08  27  Chisholm Trail  Capitol Area    13  Kevin Myers  08-20-08  27  Chisholm Trail  Capitol Area    14  Trevor Caswell  09-14-08  27  Chisholm Trail  Capitol Area    15  Clark Toliver  09-14-08  27  Chisholm Trail  Capitol Area  Tonkawa   16  Trent Steinbart  09-21-08  27  Chisholm Trail  Capitol Area    17  Kenny Finch  11-09-08  27  Chisholm Trail  Capitol Area  Tonkawa   18  Marc DeLeon  11-09-08  27  Chisholm Trail  Capitol Area  Tonkawa   19  Robert Rueda  12-15-08  27  Chisholm Trail  Capitol Area    20  Will Thompson  07-06-09  27  Chisholm Trail  Capitol Area  Tonkawa   21  Chad Tully  07-06-09  27  Chisholm Trail  Capitol Area  Tonkawa   22  Peter Hartley  08-23-09  27  Chisholm Trail  Capitol Area    23  Christian Enriquez  08-12-10  27  Chisholm Trail  Capitol Area  Tonkawa   24  JT Troeger  08-29-10  27  Chisholm Trail  Capitol Area    25  Greg Tully  08-29-10  27  Chisholm Trail  Capitol Area  Tonkawa   26  Austin Stoetzel  08-29-10  27  Chisholm Trail  Capitol Area    27  Jack Thompson  10-02-10  27  Chisholm Trail  Capitol Area    28  Frankie Fischer  04-05-11  27  Chisholm Trail  Capitol Area  Tonkawa    Patrick Barone  08-15-11    Circle Ten    29  Will Chapin  01-26-12  27  Chisholm Trail  Capitol Area  Tonkawa   30  Christopher Gramberg  01-26-12  27  Chisholm Trail  Capitol Area    31  Louis Capps  04-02-12  27  Chisholm Trail  Capitol Area    32  Joey Fischer  04-11-12  27  Chisholm Trail  Capitol Area  Tonkawa   33  TJ Fischer  04-11-12  27  Chisholm Trail  Capitol Area    34  Grant Ollmann  05-16-12  27  Chisholm Trail  Capitol Area  Tonkawa   35  Gabriel Auffant  08-08-12  27  Chisholm Trail  Capitol Area  Tonkawa   36  Rudy Villarreal  08-23-12  27  Chisholm Trail  Capitol Area    37  Abraham Platzer  11-14-12  27  Chisholm Trail  Capitol Area  Tonkawa   38  Gunn Hong  11-14-12  27  Chisholm Trail  Capitol Area  Tonkawa   39  Macklin O'Neil  12-11-12  27  Chisholm Trail  Capitol Area  Tonkawa   40  Logan Hitt  12-11-12  27  Chisholm Trail  Capitol Area  Tonkawa   41  Daniel Ferguson  05-20-13  27  Chisholm Trail  Capitol Area    42  Travis Stjern  05-20-13  27  Chisholm Trail  Capitol Area    43  Garrett Ollmann  07-09-13  27  Chisholm Trail  Capitol Area  Tonkawa   44  Satindra Saravanan  07-25-13  27  Chisholm Trail  Capitol Area  Tonkawa   45  Russell Peterson  09-26-13  27  Chisholm Trail  Capitol Area  Tonkawa   46  Andres Velasquez  11-07-13  27  Chisholm Trail  Capitol Area  Tonkawa   47  Brian Stokes  11-07-13  27  Chisholm Trail  Capitol Area  Tonkawa   48  Caleb Benson  11-21-13  27  Chisholm Trail  Capitol Area    49  Daniel Grigsby  12-19-13  27  Chisholm Trail  Capitol Area    50  Evan Monroe  02-20-14  27  Chisholm Trail  Capitol Area    51  Sam Thompson  03-06-14  27  Chisholm Trail  Capitol Area    52  Conner Tidwell  05-22-14  27  Chisholm Trail  Capitol Area  Tonkawa   53  Grant Davidson  06-17-14  27  Chisholm Trail  Capitol Area    54  Gavin Raley  06-17-14  27  Chisholm Trail  Capitol Area    55  David Alvarado  08-13-14  27  Chisholm Trail  Capitol Area    56  Noah Zunker  08-13-14  27  Chisholm Trail  Capitol Area  Tonkawa   57  Kyle Stoetzel  08-19-14  27  Chisholm Trail  Capitol Area  Tonkawa   58  Jacob Olesen  09-23-14  27  Chisholm Trail  Capitol Area  Tonkawa   59  Evan Platzer  09-23-14  27  Chisholm Trail  Capitol Area  Tonkawa   60  Jonathan Baker  12-04-14  27  Chisholm Trail  Capitol Area  Tonkawa   61  Matthew Lester  04-22-15  27  Chisholm Trail  Capitol Area  Tonkawa   62  Mish Harrison  06-02-15  27  Chisholm Trail  Capitol Area  Tonkawa   63  Michael Nzoiwu  08-10-15  27  Chisholm Trail  Capitol Area    64  Phillip Gonzalez  08-10-15  27  Chisholm Trail  Capitol Area  Tonkawa   65  Ben Fischer  09-01-15  27  Chisholm Trial  Capitol Area  Tonkawa   66  Parker Higginbotham  09-15-15  27  Chisholm Trail  Capitol Area    67  Tyler Gaston  06-13-16  27  Chisholm Trail  Capitol Area  Tonkawa   68  Gray Marshall  07-12-16  27  Chisholm Trail  Capitol Area  Tonkawa   69  Matthew Cartwright  08-24-16  27  Chisholm Trail  Capitol Area    70  George Francis V  12-08-16  27  Chisholm Trail  Capitol Area    71  Andrew Jenkins  12-08-16  27  Chisholm Trail  Capitol Area  Tonkawa   72  Thomas Gann  05-25-17  27  Chisholm Trail  Capitol Area    73  Roger Culp  06-29-17  27  Chisholm Trail  Capitol Area  Tonkawa   74  Grant DeLoach  06-29-17  27  Chisholm Trail  Capitol Area  Tonkawa   75  Zach Ortiz  11-02-17  27  Chisholm Trail  Capitol Area  Tonkawa   76  Brent Schaefer  11-09-17  27  Chisholm Trail  Capitol Area  Tonkawa   77  Miles Banister  11-09-17  27  Chisholm Trail  Capitol Area    78  William Grigsby  02-27-18  27  Chisholm Trail  Capitol Area  Tonkawa   79  Jake Tangedal  09-26-18  27  Chisholm Trail  Capitol Area    80  Matthew Jenkins  12-04-18  27  Chisholm Trail  Capitol Area    81  Miles Crain  01-10-19  27  Chisholm Trail  Capitol Area  Tonkawa   82  Jacob Horton  03-20-19  27  Chisholm Trail  Capitol Area  Tonkawa   83  Ian Irish  08-07-19  27  Chisholm Trail  Capitol Area    84  Spencer Cordero  08-07-19  27  Chisholm Trail  Capitol Area  Tonkawa   85  Jon Gann  09-18-19  27  Chisholm Trail  Capitol Area    86  Eli Zunker  09-18-19  27  Chisholm Trail  Capitol Area    87  David Schoger  10-17-19  27  Chisholm Trail  Capitol Area    88  Clark Ansley  04-24-20  27  Chisholm Trail  Capitol Area  Tonkawa   89  Zane Biscoe  08-13-20  27  Chisholm Trail  Capitol Area  Tonkawa   90  Andrew Lester  12-02-20  27  Chisholm Trail  Capitol Area    91  Patrick Jenkins  12-08-20  27  Chisholm Trail  Capitol Area     Sidd Ganti  12-29-20  265  Orion  Longhorn    92  Srihari Saravanan  01-07-21  27  Chisholm Trail  Capitol Area    93  Chase DeLoach  02-03-21  27  Chisholm Trail  Capitol Area  Tonkawa   94  Chris Mugica  03-11-21  27  Chisholm Trail  Capitol Area    95  Aneesh Chakka  04-06-21  27  Chisholm Trail  Capitol Area    96  Aidan Schwartz  05-16-21  27  Chisholm Trail  Capitol Area    97  Ethan Ortiz  05-16-21  27  Chisholm Trail  Capitol Area    98  Caleb Melendez  06-02-21  27  Chisholm Trail  Capitol Area    99  Matthew Pilcher  12-02-21  27  Chisholm Trail  Capitol Area    100  Evan Rucker  03-03-22  27  Chisholm Trail  Capitol Area    101  Kade Walters  08-09-22  27  Chisholm Trail  Capitol Area    102  Connor Benningfield  09-26-22  27  Chisholm Trail  Capitol Area    103  Michael Davis  02-20-23  27  Chisholm Trail  Capitol Area    104  Axel LeTourneau  04-25-23  27  Chisholm Trail  Capitol Area    105  Sachin Thakur  06-13-23  27  Chisholm Trail  Capitol Area   Getting help with Eagle Projects  A list of links and forms to assist the Scout in finding, planning and completing his Eagle Project.   http://www.usscouts.org/usscouts/eagle.asp \nEagle Scout Project Ideas - Project ideas for the parish or local agencies.  At Saint John Vianney - Please contact Dan O'Neil for project ideas at the church. He is currently updating the list.\n  http://www.bsacac.org/CampingEvents/ServiceOpportunities.php \nEagle Scout Rank Application  You do not need to complete the rank application yourself. Instead, obtain Eagle Application Assistance form from Advancement Chair when all requirements are complete, including Scoutmaster conference. Once you receive this form you must obtain all appropriate signatures and then deliver to Kerri Smeaton (  ksmeaton@bsacac.org ) @ the Council office for validation.  Eagle Scout Rank Application and procedures\nCAC Eagle related forms\nEagle Forms  A downloadable copy of the Eagle Workbook.  A blank form for Eagle Letters of Recommendation, plus the application for an Eagle Palm.   http://www.nesa.org/trail/manual.html \nEagle Court of Honor  Guidelines for planning an Eagle Court of Honor.   http://www.usscouts.org/usscouts/eagle.asp \nEagle Scout Info  Links and information for Scouts that have achieved the rank of Eagle.  Eagle resource   http://www.eaglescout.org  http://www.bsacac.org/EagleSearch.php",{"id":52,"path":53,"dir":54,"title":55,"description":7,"keywords":56,"body":58},"content:3.policies-and-procedures:1.joining-and-annual-rechartering.md","/policies-and-procedures/joining-and-annual-rechartering","policies-and-procedures","Joining And Annual Rechartering",[57],"To become a registered Boy Scout or Adult Leader with Troop 27 do the following:","    Joining and Annual Rechartering   Register Online     Click here for a new parent information form.  To become a registered Boy Scout or Adult Leader with Troop 27 do the following:   Read this website to learn more about our troop. Sign and return the   affirmation .  Scouts, complete and return the   Boy Scouts of America Youth Application  form under the \"Membership Applications\" section\n(You do not need to fill out the Transfer Form)under Membership Applications.\nThis is transmitted to the Capitol Area Council.  Adult leaders, complete and return the   Adult Application  form under \"Membership Applications\" section.\nThis is transmitted to the Capitol Area Council and is used for a criminal background checks.  Log in to Troopmaster and update yours and your scout’s information. (If you haven’t received the invite yet, speak with an adult member of the Troop.)  Complete and return an   Annual Health and Medical Record  - Part A and B(adults and youth) with registration.  Pay registration fee for each scout: contact the Treasurer for amount   Scouts joining from Webelos/Arrow of Light, fee includes:   BSA Registration fee  Troop 27 hat, neckerchief, segments, awards, and advancements  BSA New member fee  Scouts transferring from another troop, fee includes:   BSA Registration fee  Troop 27 hat, neckerchief, segments, awards, and advancements  BSA Transfer fee  Current Troop 27 scouts rechartering, fee includes:   BSA Registration fee  Troop 27 segments, awards, and advancements  Subscription to Boy’s Life Magazine (additional and optional)   Pay registration fee for each adult: contact the Treasurer for amount   Our troop cannot function without the participation of our adult leaders. We encourage at least one parent or guardian of\neach Scout participate as a Committee Member (i.e., to register as an Adult). The Troop Committee handles the “business” of\nthe Troop through planning, fund raising, advancement records, financial records, etc.   Complete and return the   permission slip  for photos on the web site.  You will need to visit the   scout shop  to purchase your   uniform .  See the   equipment list  for items eventually needed for camping.   You do not need to purchase all these items at once. Camping experience helps the scout decide what items to purchase.   Complete and sign the   Troop 27 Release Agreement .   Note:  Any scouts joining mid-year (after Jan- before Nov), full payment is required above and adjustments will be handled  during the following November recharter.",{"id":60,"path":61,"dir":54,"title":62,"description":7,"keywords":63,"body":64},"content:3.policies-and-procedures:2.uniform.md","/policies-and-procedures/uniform","Uniform",[],"    Uniform  In Troop 27, we hold the wearing of the uniform in the highest regard. It is a reflection of the Scout, the Troop, and Boy Scouts of America, in general. Therefore, we place great emphasis on wearing the uniform with pride.    Class B    This uniform is worn during \"active\" scout activities such as working on service projects, and during\nspecified times of a campout.         Pants  Olive green, long, recommend zip-off and synthetic   Class B Shirt  Official Troop 27 yellow T-shirt   Hat  Official Troop 27 Red Hat   Belt    Shoes/Boots  Closed toed   Watch  Wristwatch; Ideally analog   Pen     Class A - Field Dress    This Uniform is worn to Troop Meetings, Patrol Leaders Council Meetings, and Troop Committee Meetings.\nIt is the official travel and fundraising uniform of Troop 27.         Class A Shirt  BSA, long-sleeve w/ appropriate patches, synthetic   Everything required for the Class B     Class A - Full Dress    This Uniform is worn to the Troop Court Of Honor and other ceremonial activities.         Neckerchief and Slide    Merit Badge Sash    Order of the Arrow Sash  (if member of Order of the Arrow)   Everything required for the Class A - Field Dress     Uniform Resources     Boy Scout Insignia Placement    How to wear BSA Knots   Although the initial investment in a Scout uniform may seem expensive,\nthe uniform is rugged and the Scout will usually outgrow it before it wears out.\nWhen buying uniforms keep growth in mind.   Uniform Sources:\n    Capital Area Council Scout Shop  - 12500 North IH 35, Austin, Texas 78753   BSA Retail Catalog Sales  Class B T-shirts are purchased from the troop.    Troop 27 specific uniform rules    Neckerchief will be tightly rolled with square ends          Merit badges will be placed on the sash so they are parallel to the ground when worn        For segment program info click here.   ",{"id":66,"path":67,"dir":54,"title":68,"description":7,"keywords":69,"body":71},"content:3.policies-and-procedures:3.attendance.md","/policies-and-procedures/attendance","Attendance",[70],"Requirements","    Attendance Requirements   Scout participation is a requirement for rank advancement. The requirements is\nthat a scout has to be active 50% of the time in the last 6 months.\nThis is a rolling 6 months so technically if they have been 100% active in the\nprevious 3 months prior to rank advancement then they have met the requirements.  Requirements  Campout attendance  In order to meet the minimum requirements to be considered having attended a troop campout for the\npurposes of tracking attendance, one must do one of the following:    Spend the night Friday (or other first night of the campout), engage in the troop agenda for\nscouting activities until at least noon on Saturday (or other next day), and check out as appropriate.  Arrive and check in as appropriate by 6:00 PM on Saturday (or other day of primary activities),\nengage in the troop agenda for scouting activities, spend the night Saturday night (or other night\nat the conclusion of primary activities), and engage in the troop agenda the following day until troop dismissal.  If one arrives late or leaves early, they should check in/out with the SPL, their PL, and the SM.  Meeting attendance  In order to meet the minimum requirements to be considered having attended a troop meeting for the\npurposes of tracking attendance, one must do one of the following:    Be present when attendance is taken at the beginning of the meeting, engage in the troop agenda for\nscouting activities, and check out as appropriate after the midpoint of the meeting.  Check in as appropriate before the midpoint of the meeting, engage in the troop agenda for\nscouting activities, and be present at dismissal.  If one arrives late or leaves early, they should check in/out with the SPL, their PL, and the SM.",{"id":73,"path":74,"dir":54,"title":75,"description":7,"keywords":76,"body":78},"content:3.policies-and-procedures:4.financial-policy.md","/policies-and-procedures/financial-policy","Financial Policy",[77],"Financial Assistance Policy BSA Troop 27","    Financial Policy   16957028v.4  Financial Assistance Policy BSA Troop 27  A Scout is thrifty. Learning to manage money is one of the ways Scouting prepares young men for life. Earning and budgeting money to accomplish goals helps develop self-reliance and the skills of personal finance management. Although funds raised through troop fundraising activities belong to the unit, these funds can be utilized to reduce the cost of participation and provide financial assistance to individual Scouts based upon their level of participation in specific activities benefiting Troop 27.  These Troop 27 “Scout Accounts” are designed to help make Scouting affordable by offsetting the costs associated with participation in the Troop 27 program. A Scout can use these funds to pay for such expenses as registration and activity fees, uniforms, training classes, and camping costs throughout the Scout’s adventures with Troop 27. Allocations are credited towards the Scout account if the Scout choses to participate in Troop 27 fundraisers. Scouts can use this money to purchase Scout-related gear and camping fees with Troop 27. The Troop Committee has absolute discretion as to whether any particular expenditure is eligible for reimbursement solely based on whether it benefits Troop 27 or a Scout’s participation in Troop 27 Activities. All funds raised belong to the Troop and may not be transferred to the Scout or another unit. When the Scout is no longer active in the Troop or turns 18, they are returned to the general funds.  It is important to note that all revenue generated from Troop 27 fundraising activities can be used ONLY for Troop 27 activities and related expenses. All eligible expenses will need to be purchased by the Scout and then the original receipts must be turned in to the treasurer in order to receive reimbursement from the Scout account. Listed below is how Scouts can use the money allocated in their Scout accounts.  Scout Accounts can be used for:    Camping expenses, including fees for campsites, summer & winter camp fees, and High Adventure Camp costs.  Travel costs associated with Troop 27 camping activities.  Camping gear used on a routine basis (e.g. tents, sleeping bags, backpacks, Nalgene bottles, flashlights, etc.)  BSA Uniform & Troop 27 class B (e.g. caps, shirts, pants, boots, yellow shirts, etc.)  Expenses associated with merit-badge classes  Rechartering fees  Court of Honor Meal Cost  Training Classes (e.g. NYLT)  Scout’s Eagle Court of Honor Banquet expenses    Scout Account allocations CANNOT be:    used for Eagle projects  transferred to another Scout unit  used for specialty gear used 1-2 times per year. (e.g. canoes, bikes, firearms, etc.)",{"id":80,"path":81,"dir":54,"title":82,"description":7,"keywords":83,"body":85},"content:3.policies-and-procedures:5.reimbursement.md","/policies-and-procedures/reimbursement","Reimbursement",[84],"Reimbursement for Approved Expenses","    Reimbursement Procedures  Reimbursement for Approved Expenses   Before making a purchase, get the Troop's Tax Exempt ID from the Committee Treasurer\nto avoid paying sales tax.  In order to get reimbursed for approved expenditures:   Print and complete the reimbursement form,  Attach the receipts and  Submit the form and receipts to the Committee Treasurer (Email:   treasurer@bsatroop27.us )    We request all receipts be submitted within 30 days of the expenditure.",{"id":87,"path":88,"dir":54,"title":89,"description":7,"keywords":90,"body":92},"content:3.policies-and-procedures:6.rank-advancement.md","/policies-and-procedures/rank-advancement","Rank Advancement",[91],"Turning activities into advancement involves four steps:","    Rank Advancement  Turning activities into advancement involves four steps:   You LEARN. At troop meetings, patrol meetings, campouts, and at home you learn and practice skills\nthat are required for advancement. (As Scouts develop knowledge and skills, they are asked to teach\nothers and, in this way, they learn and develop leadership.)  You are TESTED.   Once you feel that you have mastered a skill, you ask your Patrol Leader to test you.  He either passes\nyou on the requirement or advises you that additional learning is needed.  (Make sure your Patrol Leader\nsigns off on the requirement at the back of your book.)  When all requirements except those signed off by adult leaders are met you sign up to rank advance at the next campout.   Requirements signed off on by adult leaders:\n   Scout Spirit  Service Hours  Cyber Chip  Participation  Troop Activities  Position of Responsibility  Scoutmaster Conference  Board of Review  At the campout, you approach the Advancement Chair for sign offs on things like Service Hours, Participation, Troop Activities, & Position of Responsibility  Then you ask the Advancement Chair to schedule a Scoutmaster Conference.  The Advancement Chair will arrange a time for you to meet with a Scoutmaster during that campout.  Be sure to be in uniform (e.g. bring a pen, watch, rope, & compass, and have the proper current rank patch on your uniform, and also a good idea to bring a camp chair)   You are REVIEWED.   For ranks above Scout, when you have completed all the requirements for a rank except the Board of Review, you meet with a Board of Review made up of troop committee members. The board makes sure you’ve completed all the requirements and also talks with you about your Scouting experience.   You are RECOGNIZED.   As soon as possible, you are recognized for your advancement at a troop meeting where you receive your badge. (You’ll later be recognized again at a special ceremony called a Court of Honor.)  Notes:   Scoutmaster Conferences and Board of Reviews are held on campouts although exceptions can be arranged.  To sign up for Rank Advancement, use the Campout sign up link and indicate you would like to Rank Advance at that upcoming Campout.  This must be done before the Thursday prior to the campout to give the adult leaders time to pull and verify your records (i.e. Service Hours).  For the purposes of advancement, “showing scout spirit” is determined by the Scoutmaster.  In order for the Scoutmaster to know if you are showing scout spirit you need to be present at activities.  This means attending at least 50% of the meetings and 50% of the outings during the advancement period prior to the Scout’s Board of Review date for a given rank (usually the six months preceding the Scoutmaster Conference).  The Scout handbook is the master record of the Scout’s achievements, if lost, some information may never be recovered. The Troop records are for administrative purposes only. It is the responsibility of the Scout to ensure the accuracy of all records as they pertain to him.  Troop 27 holds a Court of Honor two times a year to recognize those Scouts that have advanced in rank, earned merit badges, or any other awards. These are family events and all are invited.  See the BSA “Guide to Advancement” for more details",{"id":94,"path":95,"dir":54,"title":96,"description":7,"keywords":97,"body":102},"content:3.policies-and-procedures:7.merit-badges.md","/policies-and-procedures/merit-badges","Merit Badges",[98,99,100,101],"Process","Merit Badge Library","Merit badge information on the web:","Merit Badge Counselors:","    Merit Badges     TROOP 27 DOES NOT ALLOW EAGLE REQUIRED MERIT BADGES TO BE EARNED AT MERIT BADGE FAIRS OR UNIVERSITIES.\nThis policy has been set in order to ensure the quality of Eagle required merit badges.  Process  As per BSA guidelines Troop 27 uses the blue card system for Merit Badges. When a scout wishes to start working on a Merit Badge, he should follow this process:   Scout decides he wants to work on a merit badge.  Scout goes to the Advancement Chair and tells him what merit badge he wants to work on and requests a signed blue card and a counselor.  Advancement Chair looks up which adults have signed up to be a merit badge counselor for the specific merit badge and assigns a counselor to the scout.  Scout talks with the counselor and commences work on the merit badge.  As work progresses, the scout shows his completed work and discusses items with his counselor.  Upon completion, the counselor keeps one part of the blue card for his record. The counselor signs the scout's copy and gives the other two parts of the blue card back to the scout. The scout gets the Advancement Chair to sign the completed card. The scout keeps one part for his record and turns in the third part to the Advancement Chair so that so that the badge gets awarded.  Badge is awarded at the next court of honor.  Merit Badge Library  The troop also maintains a merit badge library made from donated books. After completing a merit badge feel free to donate your book so that others may benefit. See our troop Librarian for a complete list of titles available. The requirements in the merit badge books are the official requirements to earn the badge. Other resources include:  Merit badge information on the web:   https://www.scouting.org/programs/scouts-bsa/advancement-and-awards/merit-badges/  Merit Badge Counselors:  Adults can complete a Resource Survey to indicate which merit badges they are interested in serving as counselors.\nSee   A Guide For Merit Badge Counseling  for more information on being a counselor.",{"id":104,"path":105,"dir":54,"title":106,"description":7,"keywords":107,"body":110},"content:3.policies-and-procedures:8.campouts.md","/policies-and-procedures/campouts","Campouts",[108,109],"Costs","Transportation","    Campouts  Costs  Troop 27 pays for monthly campout campsites if funds allow. If the troop does not have sufficient funds to cover monthly campout costs, then the participants will be required to pay. At this time, the fundraising activities have covered campouts without issue. Scouts are required to to pay for extra activities such as horseback riding or other special activities. The troop will collect the appropriate fees at the troop meeting prior to the campout or at the campout departure.  Transportation  For the monthly campouts the troop does not provide transportation between the church and campgrounds.  Usually we have enough volunteers that your scout can carpool with.  However we do that each scout family is required to provide round trip transportation to at least 2 campouts per year.  So that we can judge if we need to ask for volunteer drivers please make sure to sign up for the monthly campouts at this troop website.",{"id":112,"path":113,"dir":54,"title":114,"description":7,"keywords":115,"body":116},"content:3.policies-and-procedures:9.election-procedures.md","/policies-and-procedures/election-procedures","Election Procedures",[],"    Election Procedures",{"id":118,"path":119,"dir":54,"title":120,"description":7,"keywords":121,"body":122},"content:3.policies-and-procedures:10.inappropriate-behavior.md","/policies-and-procedures/inappropriate-behavior","Inappropriate Behavior",[],"    Inappropriate Behavior",{"id":124,"path":125,"dir":54,"title":126,"description":7,"keywords":127,"body":128},"content:3.policies-and-procedures:11.prohibited-items.md","/policies-and-procedures/prohibited-items","Prohibited Items",[],"    Prohibited Items",{"id":130,"path":131,"dir":54,"title":132,"description":7,"keywords":133,"body":134},"content:3.policies-and-procedures:12.affirmation.md","/policies-and-procedures/affirmation","Affirmation",[],"    Affirmation  I hereby affirm that I have read and understand the policies and procedures of Troop 27. I agree to conduct myself according to these policies and to submit myself to the discipline of the Troop as set forth herein, as a condition of membership in the Troop. I will conduct myself courteously and show respect to my fellow scouts and to my Troop and adult leaders at all times.   Click here  for the printable version of the Statement of Affirmation and Agreement.",{"id":136,"path":137,"dir":54,"title":138,"description":7,"keywords":139,"body":140},"content:3.policies-and-procedures:13.carpooling.md","/policies-and-procedures/carpooling","Carpooling",[],"    Carpooling Guidelines",{"id":142,"path":143,"dir":144,"title":145,"description":7,"keywords":146,"body":147},"content:4.general-info:1.bsa-information.md","/general-info/bsa-information","general-info","Bsa Information",[],"    BSA Information",{"id":149,"path":150,"dir":144,"title":151,"description":7,"keywords":152,"body":153},"content:4.general-info:3.camping-information-and-tip.md","/general-info/camping-information-and-tip","Camping Information And Tip",[],"    Camping Information",{"id":155,"path":156,"dir":157,"title":158,"description":159,"keywords":160,"body":163},"content:8.introduction:1.getting-started.md","/introduction/getting-started","introduction","Getting Started","From your Markdown files to a deployed website in few minutes.",[161,162],"Play online","Create a new project","  Getting Started  From your Markdown files to a deployed website in few minutes.  Play online  You can start playing with Docus in your browser using Stackblitz:  Play on StackBlitz  Create a new project   Start a fresh Docus project with:     npx   nuxi@latest   init   docs   -t   themes/docus   Install the dependencies in the   docs  folder:      npm   install     yarn   install     pnpm   install   --shamefully-hoist   Run the   dev  command to start Docus in development mode:      npm   run   dev     yarn   dev     pnpm   run   dev   ✨ Well done! A browser window should automatically open for   http://localhost:3000  html.dark .shiki span {color: var(--shiki-dark) !important;background: var(--shiki-dark-bg) !important;font-style: var(--shiki-dark-font-style) !important;font-weight: var(--shiki-dark-font-weight) !important;text-decoration: var(--shiki-dark-text-decoration) !important;}",{"id":165,"path":166,"dir":157,"title":167,"description":168,"keywords":169,"body":171},"content:8.introduction:2.project-structure.md","/introduction/project-structure","Project Structure","Docus is a Nuxt theme that provides a ready-to-use documentation website, if you are familiar with Nuxt, you will feel right at home.",[170],"Directory Structure","  Project Structure  Docus is a Nuxt theme that provides a ready-to-use documentation website, if you are familiar with Nuxt, you will feel right at home.  Directory Structure  This is the minimal directory structure to get an up and running Docus website.     content/     index.md   app.config.ts   nuxt.config.ts  The   content/  directory is where you   write Markdown pages .  The   app.config.ts  is where you   configure Docus  to fit your branding and design.  The   nuxt.config.ts  is your   Nuxt configuration .  html.dark .shiki span {color: var(--shiki-dark) !important;background: var(--shiki-dark-bg) !important;font-style: var(--shiki-dark-font-style) !important;font-weight: var(--shiki-dark-font-weight) !important;text-decoration: var(--shiki-dark-text-decoration) !important;}",{"id":173,"path":174,"dir":157,"title":175,"description":176,"keywords":177,"body":179},"content:8.introduction:3.writing-pages.md","/introduction/writing-pages","Writing Pages","Docus is made to let you write all your content in Markdown and Vue components with the MDC syntax.",[178],"Frontmatter","  Writing Pages  Docus is made to let you write all your content in Markdown and Vue components with the MDC syntax.  Each Markdown pages in the   content/  folder will be mapped to a route.     File  Generated route     index.md   /    about.md   /about    blog/index.md   /blog    blog/hello.md   /blog/hello    1.guide/2.installation   /guide/installation  Frontmatter  Docus supports multiple Front-matter attributes for pages.     ---   title  :   \"Get Started\"   description  :   \"Let's learn how to use my amazing module.\"   ---      Key   Type   Default   Description     layout   string   default  Use any layout name like you would in   definePageMeta()    title   string   Defines the page title and H1 in docs pages    description   string   Defines the page description and excerpt in docs pages    redirect   string   A route path to redirect    image   object   OpenGraph cover image    Docs layout options       aside   boolean   Toggles the visibility of aside navigation    toc   boolean   Toggles the visibility of table of contents    header   boolean   Toggles the visibility of the page header    bottom   boolean   Toggles the visibility of page bottom section    Navigation options       navigation   boolean   Toggles the visibility of the page or directory in navigation    navigation.title   string   Changes the name of the page or directory in navigation    navigation.icon   string   Changes the icon of the page or directory in navigation  html.dark .shiki span {color: var(--shiki-dark) !important;background: var(--shiki-dark-bg) !important;font-style: var(--shiki-dark-font-style) !important;font-weight: var(--shiki-dark-font-weight) !important;text-decoration: var(--shiki-dark-text-decoration) !important;}",{"id":181,"path":182,"dir":157,"title":183,"description":184,"keywords":185,"body":187},"content:8.introduction:4.configuration.md","/introduction/configuration","Configuration","Learn how to configure Docus.",[186],"Customizing the logo","  Configuration  Learn how to configure Docus.      export   default   defineAppConfig  ({     docus: {       title:   'Docus'  ,       description:   'My Docus Project'  ,       url:   'http://docus.dev'     }   })     export   default   defineAppConfig  ({     docus: {       title:   'Docus'  ,       description:   'My Docus Project'  ,       url:   'http://docus.dev'  ,       image:   '/social-card-preview.png'  ,       socials: {         twitter:   '@nuxt_js'  ,         github:   'nuxt-themes/docus'  ,       },       github: {         root:   'content'  ,         edit:   true  ,         contributors:   false       },       layout:   'default'  ,       aside: {         level:   1  ,         filter: [],       },       header: {         title:   false  ,         logo:   true  ,         showLinkIcon:   false       },       footer: {         credits: {           icon:   'IconDocus'  ,           text:   'Powered by Docus'  ,           href:   'https://docus.dev'  ,         },         textLinks: [           {             text:   'Nuxt'  ,             href:   'https://nuxt.com'  ,             target:   '_blank'  ,             rel:   'noopener'           }         ],         iconLinks: [           {             label:   'NuxtJS'  ,             href:   'https://nuxtjs.org'  ,             component:   'IconNuxtLabs'  ,           },           {             label:   'Vue Telescope'  ,             href:   'https://vuetelescope.com'  ,             component:   'IconVueTelescope'  ,           },         ],       }     }   })      Key   Type   Default   Description     title   string  Docus  Website title    titleTemplate   string  Docus  Website title template    description   string  My Docus Project  Website description    url   string   Website URL    layout   string  default  Fallback layout to use (supports   default  or   page )    Socials       socials   object   {}  Social links    socials.github   string   The repository to use on GitHub links    socials.twitter   string   The account to use on Twitter links    socials.youtube   string   The channel to use on Youtube links    socials.instagram   string   The account to use on Instagram links    socials.facebook   string   The account to use on Facebook links    socials.medium   string   The account to use on Medium links    socials.[social]   object   Override social or display custom one    socials.[social].label   string   A label to use for the social    socials.[social].icon   string   A icon to use for the social    socials.[social].href   string   A link to use for the social    socials.[social].rel   string   noopener noreferrer  A space-separated list of   link types    Header       header   object   Header configuration    header.logo   boolean   Whether or not to use   Logo.vue  as the header logo    header.title   string   If set to a string, will be used in the header    header.showLinkIcon   boolean   If set to   true  links icons will show in the header    header.exclude   string[]   An array of path to exclude out from the header navigation    header.fluid   boolean   true  Make header   Container  fluid    Main       main   object   Main configuration    main.fluid   boolean   true  Make main content   Container  fluid    main.padded   boolean   true  Make main content   Container  padded    Aside       aside   object   Aside configuration    aside.level   string  0  Aside base level of nesting    aside.collapsed   boolean   Will be used as default value for collapsible navigation categories    aside.exclude   string[]   An array of path to exclude out from the aside navigation    Footer       footer   object   Footer configuration    footer.credits   object   An object defining the bottom left credits    footer.credits.icon   object   The icon to use for the credits    footer.credits.text   object   The text to use for the credits    footer.textLinks   array   []  An array of texts to display at the center of footer    footer.textLinks[0].text   string   The text to display    footer.textLinks[0].href   string   A link to use for the text    footer.textLinks[0].target   string   _self  Where to display the linked URL, as the name for a browsing context    footer.textLinks[0].rel   string   noopener noreferrer  A space-separated list of   link types    footer.iconLinks   array   []  An array of icons to display in the footer    footer.iconLinks[0].label   string   A label to use for the icon    footer.iconLinks[0].href   string   A link to use for the icon    footer.iconLinks[0].icon   string   The icon to use (can be a component name)    footer.iconLinks[0].rel   string   noopener noreferrer  A space-separated list of   link types    footer.fluid   boolean   true  Make footer   Container  fluid    GitHub       github   object   false  GitHub integration configuration    github.dir   string   Directory containing the files to be edited    github.branch   string   Branch to start editing    github.repo   string   Name of the GitHub repo to edit files    github.owner   string   Owner of the repo    github.edit   boolean   Toggle \"Edit this page on Github\" component on documentation pages    Search       fuse   object   useFuse   options  Customizing the logo  To update the logo in the header, create a component in   components/Logo.vue  with your own logo.  In this example, the image is located at   /public/img .     \u003C  template  >     \u003C  img   width  =  \"120\"   src  =  \"/img/YOURLOGO.png\"  />   \u003C/  template  >  html.dark .shiki span {color: var(--shiki-dark) !important;background: var(--shiki-dark-bg) !important;font-style: var(--shiki-dark-font-style) !important;font-weight: var(--shiki-dark-font-weight) !important;text-decoration: var(--shiki-dark-text-decoration) !important;}",{"id":189,"path":190,"dir":191,"title":192,"description":193,"keywords":194,"body":210},"content:9.api:1.components.md","/api/components","api","Components","Discover every component you can use in your content.",[195,196,197,198,199,200,201,202,203,204,205,206,207,208,209],"\u003CAlert />","\u003CBadge />","\u003CBlockHero />","\u003CButtonLink />","\u003CCallout />","\u003CCard />","\u003CCardGrid />","\u003CCodeGroup />","\u003CCodeBlock />","\u003CCopyButton />","\u003CIcon />","\u003CList />","\u003CSandbox />","\u003CTerminal />","\u003CVideoPlayer />","  Components  Discover every component you can use in your content.   \u003CAlert />     Check out an   info  alert with   code  and a   link .   Check out a   success  alert with   code  and a   link .   Check out a   warning  alert with   code  and a   link .   Check out a   danger  alert with   code  and a   link .     ::alert{type=\"info\"}   Check out an   **info**   alert with   `code`   and a [  link  ](  /  ).   ::    ::alert{type=\"success\"}   Check out a   **success**   alert with   `code`   and a [  link  ](  /  ).   ::    ::alert{type=\"warning\"}   Check out a   **warning**   alert with   `code`   and a [  link  ](  /  ).   ::    ::alert{type=\"danger\"}   Check out a   **danger**   alert with   `code`   and a [  link  ](  /  ).   ::     \u003CBadge />   \u003CBadge />  support same types as   \u003CAlert /> .     v1.2  Deprecated   Not found!     :badge[  v1.2  ]    :badge[  Deprecated  ]{type=\"warning\"}    ::badge{type=\"danger\"}   Not found!   ::     \u003CBlockHero />      Document-driven framework   Docus reconciles content creators and developers by offering to both the best tools to create and scale content-based websites.     ::block-hero   ---   cta:     -   Get started     -   /get-started   secondary:     -   Open on GitHub →     -   https://github.com/nuxtlabs/docus   snippet: npx nuxi@latest init docus-app -t nuxtlabs/docus-starter   ---   #title   Document-driven framework    #description   Docus reconciles content creators and developers by offering to both the best tools to create and scale content-based websites.   ::     \u003CButtonLink />    Play on StackBlitz     :button-link[Play on StackBlitz]{icon=\"IconStackBlitz\" href=\"https://stackblitz.com/github/nuxtlabs/docus-starter\" blank}     \u003CCallout />   \u003CCallout />  support same types as   \u003CAlert /> .      This is a callout! Click me to open.   This is the content of the callout.    This is a callout! Click me to open.   This is the content of the callout.     ::callout   #summary   This is a callout! Click me to open.    #content   This is the content of the callout.   ::       ::callout{type=\"warning\"}   #summary   This is a callout! Click me to open.    #content   This is the content of the callout.   ::     \u003CCard />      Nuxt Architecture.   Based on   Nuxt 3  and   Nuxt Content .   \nUse Nuxt to build a static site, or a serverless app.      ::card{icon=\"logos:nuxt-icon\"}    #title    Nuxt Architecture.    #description    Based on   **Nuxt 3**   and   **Nuxt Content**  . :br    Use Nuxt to build a static site, or a serverless app.    ::     \u003CCardGrid />      What's included?      Nuxt Architecture.   Harness the full power of Nuxt and the Nuxt ecosystem.    Vue Components.   Use built-in components (or your own!) inside your content.    Write Markdown.   Enjoy the ease and simplicity of Markdown and discover MDC syntax.     ::card-grid   #title   What's included    #root   :ellipsis    #default     ::card     #title     Nuxt Architecture.     #description     Harness the full power of Nuxt and the Nuxt ecosystem.     ::     ::card     #title     Vue Components.     #description     Use built-in components (or your own!) inside your content.     ::     ::card     #title     Write Markdown.     #description     Enjoy the ease and simplicity of Markdown and discover MDC syntax.     ::   ::     \u003CCodeGroup />  This component uses   slots  to create a tab panel of your code examples or preview.        yarn   add   docus     npm   install   docus     ::code-group     ```bash [Yarn]     yarn   add   docus     ```     ```bash [NPM]     npm   install   docus     ```   ::     \u003CCodeBlock />  To be used inside a   \u003CCodeGroup />  component to display a preview of some rendered code.     Hello World!     /* Added as a child of   `\u003CCodeGroup />`   */    ::code-block{label=\"Preview\" preview}     ::badge     Hello World!     ::   ::     \u003CCopyButton />        :copy-button{content=\"hey!\"}     \u003CIcon />  Icon component gives you access to all   100,000+  icons from   icones.js.org .          :icon{name=\"logos:nuxt-icon\"}   :icon{name=\"logos:vue\"}   :icon{name=\"logos:nuxt-icon\"}     \u003CList />       Important  Always    Amazing  Congrats    Do you know?  You can also do this    Be careful  Use with precautions    Drinking too much  Driving drunk     ::list{type=\"primary\"}   -   **Important**   -   Always   ::    ::list{type=\"success\"}   -   Amazing   -   Congrats   ::    ::list{type=\"info\"}   -   Do you know?   -   You can also do this   ::    ::list{type=\"warning\"}   -   Be careful   -   Use with precautions   ::    ::list{type=\"danger\"}   -   Drinking too much   -   Driving drunk   ::    \u003CSandbox />  Embed CodeSandbox/StackBlitz easily in your documentation with great performances.  Using the   IntersectionObserver  to load when visible in the viewport.        :sandbox{src=\"https://codesandbox.io/embed/nuxt-content-l164h?hidenavigation=1&theme=dark\"}     \u003CTerminal />        :terminal{content=\"nuxi build\"}     \u003CVideoPlayer />         ::div     :video-player{src=\"https://www.youtube.com/watch?v=o9e12WbKrd8\"}   ::   html.dark .shiki span {color: var(--shiki-dark) !important;background: var(--shiki-dark-bg) !important;font-style: var(--shiki-dark-font-style) !important;font-weight: var(--shiki-dark-font-weight) !important;text-decoration: var(--shiki-dark-text-decoration) !important;}",{"id":212,"path":213,"dir":191,"title":214,"description":215,"keywords":216,"body":220},"content:9.api:2.composables.md","/api/composables","Composables","Discover the Docus composables to use in your custom Vue components and pages.",[217,218,219],"useDocus()","useMenu()","useScrollspy()","  Composables  Discover the Docus composables to use in your custom Vue components and pages.   useDocus()    useDocus  ()  gives access to docus runtime config, all default values and your custom config from   app.config.ts    config  refers to the merged config of the current page.   main ,   header ,   aside ,   footer  and   titleTemplate  can be set from   _dir.yml  and any   page.md  file.  The configs in   app.config  file will be used as defaults.     \u003C  script   setup  >   const   {   config   }   =   useDocus  ()   \u003C/  script  >    \u003C  template  >     \u003C  div  >       \u003C  h1  >{{ config.title }}\u003C/  h1  >       \u003C  p  >{{ config.description }}\u003C/  p  >     \u003C/  div  >   \u003C/  template  >    tree  refers to the current navigation tree that is displayed in the   aside  component.     \u003C  script   setup  >   const   {   tree   }   =   useDocus  ()   \u003C/  script  >    \u003C  template  >     \u003C  DocsAsideTree   :links  =  \"tree\"   />   \u003C/  template  >    useMenu()   useMenu()  gives access to   $menu  plugin controlling mobile navigation globally.     const   {     // Is menu visible     visible  ,     // Close menu function     close  ,     // Open menu function     open  ,     // Toggle menu function     toggle   }   =   useMenu  ()    useScrollspy()   useScrollspy()  is used in   docs  layout to make the ToC display the currently visible headings.     const   {     // Headings on the page     visibleHeadings  ,     // Active headings (for the current page)     activeHeadings  ,     // Update headings (an array of DOM nodes)     updateHeadings   }   =   useScrollspy  ()   html.dark .shiki span {color: var(--shiki-dark) !important;background: var(--shiki-dark-bg) !important;font-style: var(--shiki-dark-font-style) !important;font-weight: var(--shiki-dark-font-weight) !important;text-decoration: var(--shiki-dark-text-decoration) !important;}",{"id":222,"path":223,"dir":191,"title":224,"description":225,"keywords":226,"body":229},"content:9.api:3.layouts.md","/api/layouts","Layouts","Docus provides multiple built-in layouts for displaying your Markdown pages.",[227,228],"default","page","  Layouts  Docus provides multiple built-in layouts for displaying your Markdown pages.   default  The default layout for every page created in the project. This layout renders multiple section alongside the content:   Aside navigation menu (togglable with   aside: false/true )  Page bottom section (togglable with   bottom: false/true )  Table of content (togglable with   toc: false/true )     ---   aside  :   true   bottom  :   true   toc  :   false   ---    Your awesome content  Current page is live sample of default layout.   page   page  layout is content focused layout. This layout does not render aside menu of table of contents.  This layout accept some configuration from content front-matter.    fluid : By setting   fluid: true  in content front-matter the content will be rendered in full width.   constrainedClass : Using this option you can modify layout container look. Like constraining layout width of changing the background.   padded : Setting   padded: true  in front-matter will add horizontal padding in the layout.     ---   title  :   Home   layout  :   page   fluid  :   true   ---  Check   Home page  as live sample of page layout  html.dark .shiki span {color: var(--shiki-dark) !important;background: var(--shiki-dark-bg) !important;font-style: var(--shiki-dark-font-style) !important;font-weight: var(--shiki-dark-font-weight) !important;text-decoration: var(--shiki-dark-text-decoration) !important;}",1696964691024]