{"_path":"/about/troop-philosophy","_dir":"about","_draft":false,"_partial":false,"_locale":"","title":"Troop Philosophy","description":"","body":{"type":"root","children":[{"type":"element","tag":"t27-banner","props":{},"children":[{"type":"element","tag":"template","props":{"v-slot:title":""},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Troop Philosophy"}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Troop 27 operates on the simple philosophy that Boy Scouts are having the most fun when hiking, exploring, and challenging themselves. To this end, we feel that lightweight camping has become a lost art. Too much emphasis has been placed on bringing creature comforts and lots of support gear. Many great troops operate this way although several trucks and trailers are required to move the troop from point to point. Cooking and cleaning soon occupy two hours per meal and, when added up, a significant portion of your time in the outdoors is wasted. Our Scouts carry their own food and gear, cook on lightweight stoves, and backpack into the campsite even if we have the ability to drive in. By doing this, the Scout learns to bring only what he needs and to pack light. At the campsite, this translates into less gear to keep track of, less gear to clean, and more time to enjoy the outdoors. Scouts in Troop 27 are constantly improving their outdoor skills through experience."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Troop 27 maintains very little camping gear (water purifier, shovel, flag, etc.) because it is expected the scout will acquire the necessary gear over time through gifts and fundraising and eventually have a complete set of camping gear he can use even after leaving scouts."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Troop 27 Purpose: (as developed by the seven parents and scouts who started the troop back in 2002!)"}]},{"type":"element","tag":"list","props":{"type":"info"},"children":[{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"To be a high speed, low drag troop.   Carry everything you need on your back!"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Respect for adults"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Respect for each other and always be willing to help each other"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Respect for the American flag and traditions"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Respect for your uniform – always worn properly with SHIRTS always tucked in"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"\"Yes sir,  Yes mam!\"  Always use with adults, not just during troop functions"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Be proud to be a scout with ultimate goal of attaining Eagle Scout rank and have fun too!"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Pay your own way to summer camp through troop & personal fund raising"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Summer camp out of the Texas summer heat!"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Meet on Sunday twice a month to help encourage a well rounded boy in sports, band, choir or any other school activity.  Prioritize and keep all in balance and still keep up with your school grades."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Above all, have fun and learn as much as you can!"}]}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:2.about:2.troop-philosophy.md","_source":"content","_file":"2.about/2.troop-philosophy.md","_extension":"md"}